<img src="../figures/HeaDS_logo_large_withTitle.png" width="300">

<img src="../figures/tsunami_logo.PNG" width="600">

# Pandas

[Pandas cheat sheet](https://github.com/Center-for-Health-Data-Science/PythonTsunami/blob/fall2021/cheat_sheets/Pandas_Cheat_Sheet.pdf)

## Introduction

Popular package for data science: offers powerful data structures that make data manipulation and analysis easy.

The **`DataFrame`** is one of them.

Pandas is built on top of `numpy`.

Pandas is well suited for tabular data with heterogeneously-typed columns, as in an Excel spreadsheet

Has an interface to directly plot using `maptlotlib`, `seaborn`, `plotly`, for example.

## Two main classes (types/ objects)

1. `pandas.Series`
2. `pandas.DataFrame`

- a `Series` is a `numpy.array` with an `Index` series.
- a column in a `DataFrame` is a `Series`.
- columns in a `DataFrame` share an `Index`

## Import relevant packages

In [2]:
import pandas as pd

## What is a `pandas.Series`

There are many ways. E.g from a list, a built-in `range` and `numpy` arrays.

But a Series is an object holding some data.

Let's create a Series from a list and a built-in `range`.

In [2]:
series_list = pd.Series([3, 4, 5, 6, 7, 8, 9, 10, 11, 12])
series_list

0     3
1     4
2     5
3     6
4     7
5     8
6     9
7    10
8    11
9    12
dtype: int64

In [24]:
#shorter: use a range
series_range = pd.Series(range(3, 13))
series_range

0     3
1     4
2     5
3     6
4     7
5     8
6     9
7    10
8    11
9    12
dtype: int64

### Indexing of data

- In a pandas Series data is named by a row index (plus column names for 2D structures like the dataframe)
- See also recent [talk on PyData2021](https://www.youtube.com/watch?v=oazUQPrs8nw) by James Powell (it's relatively fast)

In [5]:
series1 = pd.Series([1,2,3], index=['row1', 'row2', 'row3'])
series1

row1    1
row2    2
row3    3
dtype: int64

In [6]:
series2 = pd.Series([1,2,4])
series2.index = ['row1', 'row2', 'row4']
series2

row1    1
row2    2
row4    4
dtype: int64

When we work with Series or DataFrames, the `index` is respected so pay attention to it!

In [7]:
series1 + series2

row1    2.0
row2    4.0
row3    NaN
row4    NaN
dtype: float64

## What is a DataFrame?

A DataFrame is basically, a **Table** of data (or a tabular data structure) with labeled rows and columns. The rows are labeled by a special data structure called an Index, that permits fast look-up and powerful relational operations. The rows and columns of a `Dataframe` are themselves `Series`. 

![alt text](../figures/pandas_dataframe.png "Title")

<div style="text-align: right"> From https://www.geeksforgeeks.org/ </div>

### Creating a DataFrame

There are several ways to create a DataFrame object from other data structures:

* from a `list` of `list`s
* from a `list` of `dict`s
* from a `dict` of `list`s
* from a `dict` of `dict`s

For simplicity we will only go over the list of lists. You can look up the other ways online.

In [8]:
data = [
    [2.23, 1, "test"],
    [3.45, 2, "train"],
    [4.5, 3, "test"],
    [6.0, 4, "train"]
]

df = pd.DataFrame(data, columns=['A', 'B', 'C'])
df

      A  B      C
0  2.23  1   test
1  3.45  2  train
2  4.50  3   test
3  6.00  4  train

### Indexing of data

A DataFrame has both row and column names. Row names are called the `index`. Both of these can be changed, either at creation or later by assignment.

In [9]:
data = [
    [2.23, 1, "test"],
    [3.45, 2, "train"],
    [4.5, 3, "test"],
    [6.0, 4, "train"]
]

df = pd.DataFrame(data, index=['row1', 'row2', 'row3', 'row4'], columns=['A', 'B', 'C'])
df

         A  B      C
row1  2.23  1   test
row2  3.45  2  train
row3  4.50  3   test
row4  6.00  4  train

In [ ]:
df.index = ['a', 'b', 'c', 'd']
df

### Adding to DataFrames

You can always create an empty DataFrame object and add columns with this syntax. We use the same syntax to add columns to existing DataFrames.

In [ ]:
df = pd.DataFrame()
df['A'] = [2.23, 3.45, 4.5, 6.0]
df['B'] = [1, 2, 3, 4]
df['C'] = ["test", "train", "test", "train"]

df

### Exercise 1
Please recreate the table below as a Dataframe:

|  | Year | Product | Cost |
| ---| :--: | :----:  | :--: |
| 0  | 2015 | Apples  | 0.35 |
| 1  | 2016 | Apples  | 0.45 |
| 2  | 2015 | Bananas | 0.75 |
| 3  | 2016 | Bananas | 1.10 |

## Loading data into `DataFrame`s from a file

Pandas has functions that can make DataFrames from a wide variety of file types.  To do this, use one of the functions in Pandas that start with `read_`.  Here is a non-exclusive list of examples:

| File Type | Function Name |
| :----:    |  :---:  |
| Excel | `pd.read_excel` |
| CSV, TSV | `pd.read_csv` |
| H5, HDF, HDF5 | `pd.read_hdf` |
| JSON  | `pd.read_json` |
| SQL | `pd.read_sql_table` |

> These are all functions, which can be called, i.e. `pd.read_csv()`

### Loading the Data

The file can be local or **hosted**: The `read_*`-function have many options and are very high general (in the sense of broad or comprehensive) functions.

In [3]:
url_ecdc_daily_cases = "https://opendata.ecdc.europa.eu/covid19/nationalcasedeath_eueea_daily_ei/csv/data.csv"
df = pd.read_csv(url_ecdc_daily_cases)
df

,dateRep,day,month,year,cases,deaths,countriesAndTerritories,geoId,countryterritoryCode,popData2020,continentExp
0,23/10/2022,23,10,2022,3557.0,0.0,Austria,AT,AUT,8901064,Europe
1,22/10/2022,22,10,2022,5494.0,4.0,Austria,AT,AUT,8901064,Europe
2,21/10/2022,21,10,2022,7776.0,4.0,Austria,AT,AUT,8901064,Europe
3,20/10/2022,20,10,2022,8221.0,6.0,Austria,AT,AUT,8901064,Europe
4,19/10/2022,19,10,2022,10007.0,8.0,Austria,AT,AUT,8901064,Europe
...,...,...,...,...,...,...,...,...,...,...,...
28724,08/02/2020,8,2,2020,0.0,0.0,Sweden,SE,SWE,10327589,Europe
28725,07/02/2020,7,2,2020,0.0,0.0,Sweden,SE,SWE,10327589,Europe
28726,06/02/2020,6,2,2020,0.0,0.0,Sweden,SE,SWE,10327589,Europe
28727,05/02/2020,5,2,2020,0.0,0.0,Sweden,SE,SWE,10327589,Europe
28728,04/02/2020,4,2,2020,1.0,0.0,Sweden,SE,SWE,10327589,Europe

## Examining the Dataset

Sometimes, we might just want to quickly inspect the DataFrame:

#### Attributes
```python
df.shape    # Shape of the object (2D)
df.dtypes   # Data types in each column
df.index    # Index range
df.columns  # Column names
```

#### Functions

```python
df.head()       # Displays first 5 rows
df.tail()       # Displays last 5 rows
df.sample()     # Displays 1 random row
df.info()       # DataFrame information
```

### Shape

A DataFrame has two dimensions. The first one (axis 0!) is along the rows, the second one (axis 1) is along the columns. You can also use
`axis='index'` and `axis='columns'`.

axis | descriptions
---  | ---
0    | index
1    | columns

In [11]:
df.shape

(28729, 11)

### Data types

In [13]:
df.dtypes

dateRep                     object
day                          int64
month                        int64
year                         int64
cases                      float64
deaths                     float64
countriesAndTerritories     object
geoId                       object
countryterritoryCode        object
popData2020                  int64
continentExp                object
dtype: object

### Index and Columns

In [14]:
df.index

RangeIndex(start=0, stop=28729, step=1)

In [15]:
df.columns

Index(['dateRep', 'day', 'month', 'year', 'cases', 'deaths',
       'countriesAndTerritories', 'geoId', 'countryterritoryCode',
       'popData2020', 'continentExp'],
      dtype='object')

### Head, tail and sample

In [ ]:
df.head()

In [ ]:
df.tail()

In [ ]:
df.sample(15)

### Info

In [16]:
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28729 entries, 0 to 28728
Data columns (total 11 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   dateRep                  28729 non-null  object
 1   day                      28729 non-null  int64
 2   month                    28729 non-null  int64
 3   year                     28729 non-null  int64
 4   cases                    28636 non-null  float64
 5   deaths                   28437 non-null  float64
 6   countriesAndTerritories  28729 non-null  object
 7   geoId                    28729 non-null  object
 8   countryterritoryCode     28729 non-null  object
 9   popData2020              28729 non-null  int64
 10  continentExp             28729 non-null  object
dtypes: float64(2), int64(4), object(5)
memory usage: 9.9 MB

`.info()` does not return anything so you cannot save it into a object.

In [17]:
_ = df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28729 entries, 0 to 28728
Data columns (total 11 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   dateRep                  28729 non-null  object
 1   day                      28729 non-null  int64
 2   month                    28729 non-null  int64
 3   year                     28729 non-null  int64
 4   cases                    28636 non-null  float64
 5   deaths                   28437 non-null  float64
 6   countriesAndTerritories  28729 non-null  object
 7   geoId                    28729 non-null  object
 8   countryterritoryCode     28729 non-null  object
 9   popData2020              28729 non-null  int64
 10  continentExp             28729 non-null  object
dtypes: float64(2), int64(4), object(5)
memory usage: 2.4+ MB

In [19]:
print(_)

None

## Renaming index/column names

Data might come to us with index names, column names or othe naming conventions that do not fit our requirements.

You can change those names to something more fitting, using the ```rename()``` function.

If you want to change index names and/or column names, use the keyword ```index``` or ```columns```, respectively, and pass a dictionary with the original index/column name as key, and the new name as value.

```python
df.rename(columns={'A':'Column A', 'D':'Column D'})

df.rename(index={0:'row1', 1:'row2', 100:'end row'})
```

You can also pass functions to ```rename()```:

```python
df.rename(index=str)           # Change the index data type to string

df.rename(columns=str.lower)   # Make all column names lowercase
```


To keep the changes, set the ```inplace``` argument to ```True```, or store the changed DataFrame in a variable:

```python
df.rename(index=str, inplace=True)

new_df = df.rename(index=str)
```

In [20]:
rename_df = df.rename(columns={'day':'Column day', 'deaths':'Column deaths'}, index={0:'row1', 1:'row2', 100:'end row'})
rename_df.head()

,dateRep,Column day,month,year,cases,Column deaths,countriesAndTerritories,geoId,countryterritoryCode,popData2020,continentExp
row1,23/10/2022,23,10,2022,3557.0,0.0,Austria,AT,AUT,8901064,Europe
row2,22/10/2022,22,10,2022,5494.0,4.0,Austria,AT,AUT,8901064,Europe
2,21/10/2022,21,10,2022,7776.0,4.0,Austria,AT,AUT,8901064,Europe
3,20/10/2022,20,10,2022,8221.0,6.0,Austria,AT,AUT,8901064,Europe
4,19/10/2022,19,10,2022,10007.0,8.0,Austria,AT,AUT,8901064,Europe

In [21]:
df.head()

,dateRep,day,month,year,cases,deaths,countriesAndTerritories,geoId,countryterritoryCode,popData2020,continentExp
0,23/10/2022,23,10,2022,3557.0,0.0,Austria,AT,AUT,8901064,Europe
1,22/10/2022,22,10,2022,5494.0,4.0,Austria,AT,AUT,8901064,Europe
2,21/10/2022,21,10,2022,7776.0,4.0,Austria,AT,AUT,8901064,Europe
3,20/10/2022,20,10,2022,8221.0,6.0,Austria,AT,AUT,8901064,Europe
4,19/10/2022,19,10,2022,10007.0,8.0,Austria,AT,AUT,8901064,Europe

## Indexing and Selecting Data

### Native accessors

Pandas has a lot of flexibility in the number of syntaxes it supports.  For example, to select columns in a DataFrame:

```python
df['Column1']
df.Column1  # no whitespaces possible!
```

Multiple Columns can also be selected by providing a list:

```python
df[['Column1', 'Column2']]
```

In [22]:
df['day']

0        23
1        22
2        21
3        20
4        19
         ..
28724     8
28725     7
28726     6
28727     5
28728     4
Name: day, Length: 28729, dtype: int64

A DataFrame row or column is always a Series!

In [23]:
type(df['day'])

pandas.core.series.Series

In [ ]:
df[['year', 'month', 'day']]

In [ ]:
df['day'][0]

### .loc - Label-based selection

To have more flexibility in selecting either only rows or both rows and columns at the same time we used the label based selector called `.loc`. 

![alt text](../figures/df_loc.png "Title")

In [28]:
#select a single column
df.loc[:, 'deaths']

0        0.0
1        4.0
2        4.0
3        6.0
4        8.0
        ...
28724    0.0
28725    0.0
28726    0.0
28727    0.0
28728    0.0
Name: deaths, Length: 28729, dtype: float64

In [29]:
#select multiple columns
df.loc[:, ['deaths', 'day']]

       deaths  day
0         0.0   23
1         4.0   22
2         4.0   21
3         6.0   20
4         8.0   19
...       ...  ...
28724     0.0    8
28725     0.0    7
28726     0.0    6
28727     0.0    5
28728     0.0    4

[28729 rows x 2 columns]

In [30]:
#select both rows and columns
df.loc[:2, 'deaths']

0    0.0
1    4.0
2    4.0
Name: deaths, dtype: float64

In [31]:
#select both rows and multiple columns
df.loc[:2, ['deaths', 'day']]

   deaths  day
0     0.0   23
1     4.0   22
2     4.0   21

In [32]:
#you can also use a list for the rows
df.loc[[2, 5, 40, 120], 'deaths']

2      4.0
5      7.0
40     4.0
120    4.0
Name: deaths, dtype: float64

### Exercise 2

Display the first 5 lines of the dataset.

In [26]:
df.head()

,dateRep,day,month,year,cases,deaths,countriesAndTerritories,geoId,countryterritoryCode,popData2020,continentExp
0,23/10/2022,23,10,2022,3557.0,0.0,Austria,AT,AUT,8901064,Europe
1,22/10/2022,22,10,2022,5494.0,4.0,Austria,AT,AUT,8901064,Europe
2,21/10/2022,21,10,2022,7776.0,4.0,Austria,AT,AUT,8901064,Europe
3,20/10/2022,20,10,2022,8221.0,6.0,Austria,AT,AUT,8901064,Europe
4,19/10/2022,19,10,2022,10007.0,8.0,Austria,AT,AUT,8901064,Europe

Show the last 15 lines

Check 10 random lines of the dataset

Make a new dataframe containing just the date, population data and number of cases and deaths

Make a new dataframe containing just the rows 10, 15 and 26 of the dataset.

### Conditional selection

When we use `.loc` we also use a condition to select rows instead of their number:

```python
df.loc[df['Column1'] > 0]   
```

Note that we have to repeat the name of the dataframe, `df` in the condition. 

In general:

![alt text](../figures/df_loc_condition.png "Title")

In [35]:
#only selecting on rows
df.loc[df['deaths'] > 1000]

,dateRep,day,month,year,cases,deaths,countriesAndTerritories,geoId,countryterritoryCode,popData2020,continentExp
9297,24/11/2020,24,11,2020,9155.0,1004.0,France,FR,FRA,67320216,Europe
9301,20/11/2020,20,11,2020,22882.0,1138.0,France,FR,FRA,67320216,Europe
9304,17/11/2020,17,11,2020,45522.0,1219.0,France,FR,FRA,67320216,Europe
9311,10/11/2020,10,11,2020,22180.0,1220.0,France,FR,FRA,67320216,Europe
9520,15/04/2020,15,4,2020,2633.0,1438.0,France,FR,FRA,67320216,Europe
9526,09/04/2020,9,4,2020,4286.0,1341.0,France,FR,FRA,67320216,Europe
9528,07/04/2020,7,4,2020,3777.0,1417.0,France,FR,FRA,67320216,Europe
9531,04/04/2020,4,4,2020,4267.0,1053.0,France,FR,FRA,67320216,Europe
9532,03/04/2020,3,4,2020,5233.0,2004.0,France,FR,FRA,67320216,Europe
10259,07/01/2021,7,1,2021,26110.0,1032.0,Germany,DE,DEU,83166711,Europe
10261,05/01/2021,5,1,2021,27431.0,1042.0,Germany,DE,DEU,83166711,Europe
10267,30/12/2020,30,12,2020,31056.0,1296.0,Germany,DE,DEU,83166711,Europe
10268,29/12/2020,29,12,2020,27563.0,1252.0,Germany,DE,DEU,83166711,Europe
10274,23/12/2020,23,12,2020,33969.0,1253.0,Germany,DE,DEU,83166711,Europe
10275,22/12/2020,22,12,2020,28973.0,1198.0,Germany,DE,DEU,83166711,Europe
10279,18/12/2020,18,12,2020,29751.0,1052.0,Germany,DE,DEU,83166711,Europe
10280,17/12/2020,17,12,2020,31952.0,1168.0,Germany,DE,DEU,83166711,Europe
10281,16/12/2020,16,12,2020,31356.0,1070.0,Germany,DE,DEU,83166711,Europe
10282,15/12/2020,15,12,2020,26927.0,1016.0,Germany,DE,DEU,83166711,Europe
10287,10/12/2020,10,12,2020,29040.0,1080.0,Germany,DE,DEU,83166711,Europe
11013,01/09/2021,1,9,2021,2868.0,13743.0,Greece,EL,GRC,10718565,Europe
11866,31/12/2021,31,12,2021,26030.0,1158.0,Hungary,HU,HUN,9769526,Europe

You can also us complex conditions composed of multiple conditions. 


It is very important that you use the element-wise ("bit-wise") logical operators **`&`** for `AND` and **`|`** for `OR` and remember to protect the individual conditions with bracets:

In [39]:
#only selecting on rows
df.loc[(df['deaths'] > 1000) & (df['countriesAndTerritories'] == 'France')]

,dateRep,day,month,year,cases,deaths,countriesAndTerritories,geoId,countryterritoryCode,popData2020,continentExp
9297,24/11/2020,24,11,2020,9155.0,1004.0,France,FR,FRA,67320216,Europe
9301,20/11/2020,20,11,2020,22882.0,1138.0,France,FR,FRA,67320216,Europe
9304,17/11/2020,17,11,2020,45522.0,1219.0,France,FR,FRA,67320216,Europe
9311,10/11/2020,10,11,2020,22180.0,1220.0,France,FR,FRA,67320216,Europe
9520,15/04/2020,15,4,2020,2633.0,1438.0,France,FR,FRA,67320216,Europe
9526,09/04/2020,9,4,2020,4286.0,1341.0,France,FR,FRA,67320216,Europe
9528,07/04/2020,7,4,2020,3777.0,1417.0,France,FR,FRA,67320216,Europe
9531,04/04/2020,4,4,2020,4267.0,1053.0,France,FR,FRA,67320216,Europe
9532,03/04/2020,3,4,2020,5233.0,2004.0,France,FR,FRA,67320216,Europe

We can select for columns at the same time:

In [40]:
#Select days were the number of deaths was greater than 1000 in France, but only display the deaths, cases and country
df.loc[(df['deaths'] > 1000) & (df['countriesAndTerritories'] == 'France'), ['deaths', 'cases', 'countriesAndTerritories']]

      deaths    cases countriesAndTerritories
9297  1004.0   9155.0                  France
9301  1138.0  22882.0                  France
9304  1219.0  45522.0                  France
9311  1220.0  22180.0                  France
9520  1438.0   2633.0                  France
9526  1341.0   4286.0                  France
9528  1417.0   3777.0                  France
9531  1053.0   4267.0                  France
9532  2004.0   5233.0                  France

To make the selection code line easier to read you can also define your conditions for the rows outside of `.loc` and save them in a variable. This is referred to as a `mask`:

In [42]:
#here we save our conditions
mask = (df['deaths'] > 1000) & (df['countriesAndTerritories'] == 'France')

#the actual selection
df.loc[mask, ['deaths', 'cases', 'countriesAndTerritories']]

      deaths    cases countriesAndTerritories
9297  1004.0   9155.0                  France
9301  1138.0  22882.0                  France
9304  1219.0  45522.0                  France
9311  1220.0  22180.0                  France
9520  1438.0   2633.0                  France
9526  1341.0   4286.0                  France
9528  1417.0   3777.0                  France
9531  1053.0   4267.0                  France
9532  2004.0   5233.0                  France

Be aware that the selections we made above were not saved, only displayed. 

If you need to save a selection into a new DataFrame you need to assign it:

In [43]:
filtered_df = df.loc[mask, ['deaths', 'cases', 'countriesAndTerritories']]
filtered_df.head()

      deaths    cases countriesAndTerritories
9297  1004.0   9155.0                  France
9301  1138.0  22882.0                  France
9304  1219.0  45522.0                  France
9311  1220.0  22180.0                  France
9520  1438.0   2633.0                  France

Other logical operators to create conditions:
- [`pandas.Series.isin`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.isin.html)
- [`pandas.Series.betweeen`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.between.html?highlight=between#pandas.Series.between)
- [`pandas.DataFrame.notnull`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.notnull.html)
- [`pandas.DataFrame.isnull`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.isnull.html)

### Exercise 3

Make a new dataframe with the date, number of cases, number deaths and country (for checking) for Denmark.

In [11]:
new_df = df.loc[df['countriesAndTerritories'] == 'Denmark', ['dateRep', 'cases', 'deaths', 'countriesAndTerritories']]
new_df.head()

         dateRep   cases  deaths countriesAndTerritories
5670  24/10/2022  2578.0    39.0                 Denmark
5671  21/10/2022   971.0    13.0                 Denmark
5672  20/10/2022  1141.0    12.0                 Denmark
5673  19/10/2022  1444.0    16.0                 Denmark
5674  18/10/2022  1387.0    11.0                 Denmark

Now from your new DataFrame, display only the rows, i.e. dates with over 500 cases.

In [16]:
new_df.loc[new_df['cases'] > 5000]

         dateRep   cases  deaths countriesAndTerritories
5739  18/07/2022  5568.0    12.0                 Denmark
5744  11/07/2022  5585.0    19.0                 Denmark
5843  25/03/2022  5654.0    36.0                 Denmark
5844  24/03/2022  5408.0    30.0                 Denmark
5845  23/03/2022  6291.0    30.0                 Denmark
...          ...     ...     ...                     ...
5949  09/12/2021  6985.0     8.0                 Denmark
5950  08/12/2021  6629.0    16.0                 Denmark
5951  07/12/2021  6324.0     7.0                 Denmark
5952  06/12/2021  7146.0     9.0                 Denmark
5957  01/12/2021  5120.0     5.0                 Denmark

[106 rows x 4 columns]

Display only the dates where there were over 500 cases or over 20 deaths (in Denmark).

In [15]:
new_df.loc[(new_df['cases'] > 5000) | (new_df['deaths'] > 20)]

         dateRep   cases  deaths countriesAndTerritories
5670  24/10/2022  2578.0    39.0                 Denmark
5675  17/10/2022  3387.0    22.0                 Denmark
5720  15/08/2022  4041.0    24.0                 Denmark
5725  08/08/2022  3511.0    50.0                 Denmark
5730  01/08/2022  3957.0    32.0                 Denmark
...          ...     ...     ...                     ...
6297  26/12/2020  1834.0    26.0                 Denmark
6298  25/12/2020  2992.0    21.0                 Denmark
6299  24/12/2020  2869.0    22.0                 Denmark
6301  22/12/2020  2543.0    21.0                 Denmark
6566  01/04/2020   282.0    22.0                 Denmark

[156 rows x 4 columns]

## Summary functions

Pandas' Series and DataFrames are iterables and can be given to any function that expects a list or Numpy Array. For example, to compute basic statistics for a colum (`Series`):

```python
df.describe() # describe numeric columns
df['Column1'].describe() # describe a particular column/series
df['Column1'].count()    # counts non-NA cells
df['Column1'].nunique()  # counts number of distinct elements in specified axis
df['Column1'].unique()   # returns array of unique values of Series, in order of appearance
df['Column1'].value_counts()  # returns list of unique values and how often they occur in the dataset

df['Column1'].max()
df['Column1'].mean()
df['Column1'].idxmax()
```

or for row:

```python
df.loc['row_index_label'].sum() # count, std, mean, etc
```

or for all columns

```python
df.mean() # default by column (= over all index)
```

or for all rows

```python
df.mean(axis=1)
df.mean(axis='columns') # columns axis is axis 1
```

> What the default axis for a method (or operation) will vary.

Example documentation: [`var`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.var.html#pandas.DataFrame.var)

Remember to use the `numeric_only` argument.

In [18]:
df.mean(numeric_only=True)  # uses numeric column only

day            1.568185e+01
month          6.431446e+00
year           2.020968e+03
cases          6.088425e+03
deaths         4.086616e+01
popData2020    1.534803e+07
dtype: float64

### Exercise 4

What is the lowest number of deaths reported in the Dataframe? Do you think it is accurate?

Can you get out the entire row (not only the number of deaths?) Which country has this number of deaths been reported for?

You can find the function you need in the 
[Section 'Reindexing / selection / label manipulation' of the API](https://pandas.pydata.org/docs/reference/frame.html#reindexing-selection-label-manipulation).

How many unique dates are in this data set?

How many different death counts have been reported in Denmark? (Imagine you want to make a histogram.)

What is the average of reported deaths for Norway?

## Modifying Data

You can change existing columns or add new ones by assignment:

A constant value:
```python
df['constant_col'] = 10
```

Any iterable:
```python
df['counting_up'] = range(0, len(df), 1)  # 0, 1, 2, ... n
```

You can create a columns based on the transformation of another columns' numerical values:
```python
df['Col1_times_5'] = df['Column1'] * 5
```

Or modify strings:
```python
df['Column10'] = df['Column10'].str.upper()
```

If the column *didn't* exist before it does now (unless you refer to the column itself like in the example above with `'Column10'`). If it *did* exist before it will be **overwritten** with the new assigned value. Be sure you mean what you type.  

You can also delete a column:
```python
del df['B']
```

In [44]:
# Create new column based on the number of cases per 100.000 population
df['cases_per_100k'] = df['cases'] / df['popData2020'] * 100000

# Filter dataset to include only Denmark
mask_denmark = df['countriesAndTerritories'] == 'Denmark'
df[mask_denmark]

,dateRep,day,month,year,cases,deaths,countriesAndTerritories,geoId,countryterritoryCode,popData2020,continentExp,cases_per_100k
5670,24/10/2022,24,10,2022,2578.0,39.0,Denmark,DK,DNK,5822763,Europe,44.274514
5671,21/10/2022,21,10,2022,971.0,13.0,Denmark,DK,DNK,5822763,Europe,16.675932
5672,20/10/2022,20,10,2022,1141.0,12.0,Denmark,DK,DNK,5822763,Europe,19.595508
5673,19/10/2022,19,10,2022,1444.0,16.0,Denmark,DK,DNK,5822763,Europe,24.799223
5674,18/10/2022,18,10,2022,1387.0,11.0,Denmark,DK,DNK,5822763,Europe,23.820307
...,...,...,...,...,...,...,...,...,...,...,...,...
6596,02/03/2020,2,3,2020,4.0,0.0,Denmark,DK,DNK,5822763,Europe,0.068696
6597,01/03/2020,1,3,2020,1.0,0.0,Denmark,DK,DNK,5822763,Europe,0.017174
6598,28/02/2020,28,2,2020,1.0,0.0,Denmark,DK,DNK,5822763,Europe,0.017174
6599,27/02/2020,27,2,2020,1.0,0.0,Denmark,DK,DNK,5822763,Europe,0.017174
6600,26/02/2020,26,2,2020,1.0,0.0,Denmark,DK,DNK,5822763,Europe,0.017174

For more complicated operations, where you want to combine `DataFrame`s with `Series`, you can have a look [how broadcasting works](https://pandas.pydata.org/pandas-docs/stable/user_guide/basics.html#flexible-binary-operations) in pandas.

### Exercise 5

Add a column that is the number of deaths per 100.000 people (population). Which country has the highest number of deaths per 100k and on which day?

Make the country code column lower-case.

Make a column called "recovered" where you substract the number of deaths from the number of cases. (Disclaimer: I know people don't die the day they are diagnosed, this is just an exericse).

## GroupBy Operations and Sorting

In most of our tasks, getting single metrics from a dataset is not enough, and we often actually want to compare metrics between groups or conditions.

The [**`groupby`**](https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html)
method essentially splits the data into different groups depending on a variable of your choice, and allows you to apply summary functions on each group. For example, if you wanted to calculate the mean number of cases by month from a given our `DataFrame`:

```python
df.groupby('month')['cases']mean()
```
where "month" is a column name from the [`DataFrame`](https://pandas.pydata.org/pandas-docs/stable/reference/frame.html).
 
You can also group by multiple columns, by providing a list of column names:
 
```python
df.groupby(['year', 'month'])['cases']mean()
```

> Aggregating by multiple columns will create an [`MultiIndex`](https://pandas.pydata.org/pandas-docs/stable/user_guide/advanced.html) row-Index.  
> You can access indices with more than one entry using tuples: `df.loc[(first_index, second_index)]`

In [31]:
#generally, more people get sick in winth months:
df.groupby('month')['cases'].mean()

month
1     18808.492701
2     12568.842632
3      8542.335783
4      5707.275330
5      2477.788348
6      2688.295516
7      4681.909596
8      2481.714652
9      2430.605193
10     4490.971906
11     6343.997193
12     7710.232698
Name: cases, dtype: float64

In [41]:
#what if we also make different groups for the different years? 
df.groupby(['year','month'])['cases'].mean()

year  month
2020  1            0.641975
      2           12.809917
      3          538.661765
      4          547.857778
      5          170.277419
      6          132.764444
      7          203.895699
      8          549.660194
      9         1133.876254
      10        3909.909586
      11        5751.568539
      12        4376.206174
2021  1         4620.321272
      2         3379.391463
      3         4928.130769
      4         4515.840270
      5         1572.473626
      6          626.706682
      7         1892.096175
      8         2113.765591
      9         1692.169643
      10        2638.269859
      11        6935.760943
      12       10968.812500
2022  1        34444.220541
      2        25186.873508
      3        19710.627155
      4        12292.334873
      5         5883.547018
      6         7676.625908
      7        12547.521077
      8         4925.250859
      9         4639.811138
      10        8103.327948
Name: cases, dtype: float64

We should probably save this result into a multi index dataframe:

In [39]:
year_month_cases = df.groupby(['year','month'])['cases'].mean()

#now we can query the new dataframe
print('Average cases january 2020:', year_month_cases.loc[2020,1])
print('Average cases january 2021:', year_month_cases.loc[2021,1])
print('Average cases january 2022:', year_month_cases.loc[2022,1])

Average cases january 2020: 0.6419753086419753
Average cases january 2021: 4620.321271929824
Average cases january 2022: 34444.22054054054

It seems that vaccines work.

### Exercise 6

What was the median number of daily cases per country?

On average, how many cases are there for each month in each country?

How many days where there without deaths in each country?

1. First, we have to select only rows, i.e. days where no one died. 

2. Now we count the number of rows. Have a look at [Computations and descriptive stats](https://pandas.pydata.org/docs/reference/frame.html#computations-descriptive-stats), or ask google/chatGTP.

3. Now reduce the result to one column instead of all columns since they should all have the same number of rows.

### Sorting

Sort a dataset based on column values, with ```sort_values()```:

```python
df.sort_values(by='cases')
```

By default, values are sorted in ascending order (alhpabetically). To change to descending order, change the argument ```ascending``` to ```False```:

```python
df.sort_values(by='cases', ascending=False)
```

To sort the dataset based on index values, use the companion function ```sort_index()```. This function has the same arguments and default order:

```python
df.groupby(by='countriesAndTerritories').agg({'cases': 'sum', 'deaths': sum}).sort_index()
```

You can also sort by more than one column at a time:

```python
df.sort_values(by=['countriesAndTerritories', 'cases'], ascending=False)
```

In [45]:
df.sort_values('cases_per_100k', ascending=False)

,dateRep,day,month,year,cases,deaths,countriesAndTerritories,geoId,countryterritoryCode,popData2020,continentExp,cases_per_100k
12776,17/02/2022,17,2,2022,13784.0,4.0,Iceland,IS,ISL,364134,Europe,3785.419653
12756,10/03/2022,10,3,2022,8726.0,6.0,Iceland,IS,ISL,364134,Europe,2396.370567
20381,08/02/2022,8,2,2022,391552.0,8.0,Netherlands,NL,NLD,17407585,Europe,2249.318329
12772,21/02/2022,21,2,2022,7408.0,0.0,Iceland,IS,ISL,364134,Europe,2034.415902
10700,11/07/2022,11,7,2022,215856.0,20.0,Greece,EL,GRC,10718565,Europe,2013.851668
...,...,...,...,...,...,...,...,...,...,...,...,...
26915,11/04/2022,11,4,2022,NaN,38.0,Spain,ES,ESP,47332614,Europe,NaN
26916,10/04/2022,10,4,2022,NaN,47.0,Spain,ES,ESP,47332614,Europe,NaN
26917,09/04/2022,9,4,2022,NaN,42.0,Spain,ES,ESP,47332614,Europe,NaN
26919,07/04/2022,7,4,2022,NaN,53.0,Spain,ES,ESP,47332614,Europe,NaN
26920,06/04/2022,6,4,2022,NaN,42.0,Spain,ES,ESP,47332614,Europe,NaN

## Handling Missing Values

Missing values are often a concern in data science, for example in proteomics, and can be indicated with a **`None`** or **`NaN`** (np.nan in Numpy). Pandas DataFrames have several methods for detecting, removing and replacing these values:

| method | description
| ---:  | :---- |
**`isna()`** | Returns True for each NaN |
**`notna()`** | Returns False for each NaN |
**`dropna()`** | Returns just the rows without any NaNs |

Here we will use the titanic data which contains some missing values:

In [47]:
url = 'https://raw.githubusercontent.com/mwaskom/seaborn-data/master/titanic.csv'
titanic = pd.read_csv(url)
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [54]:
titanic.isna()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
887,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,True,False,False,False,False,False,False,False,True,False,False,False
889,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False

Which columns contain missing data?

In [50]:
titanic.isna().any()

survived       False
pclass         False
sex            False
age             True
sibsp          False
parch          False
fare           False
embarked        True
class          False
who            False
adult_male     False
deck            True
embark_town     True
alive          False
alone          False
dtype: bool

Extra trick: In python `True` is 1 and `False` is 0, so we can actually `sum()` the output of `isna()` to get the number of missing values. So smart!

In [48]:
titanic.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

Detect missing values in column "Column1" and retrieve the rows where they are present:

```python
missing_data_rows = df.loc[df['Column1'].isna()]
```

In [53]:
age_missing = titanic.loc[titanic['age'].isna()]
age_missing

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
17,1,2,male,NaN,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True
26,0,3,male,NaN,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True
28,1,3,female,NaN,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
868,0,3,male,NaN,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True
878,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

### Exercise 8

Display rows for which the embark town is missing.

Make a dataframe with only the rows containing no missing data.

How many rows don't contain any missing data at all?

How can you calculate what proportion of the "deck" column is missing data? Hint: Use the ability of python to interpret booleans as 0/1.

### Imputation

Imputation means replacing the missing values with real values. 

| method | description |
| ----: |  :---- |
| **`fillna()`** | Replaces the NaNs with values (provides lots of options) |
| **`ffill()`** | Replaces the Nans with the previous non-NaN value (equivalent to df.fillna(method='ffill') |
| **`bfill()`** | Replaces the Nans with the following non-NaN value (equivalent to df.fillna(method='bfill') |
| **`interpolate()`** | interpolates nans with previous and following values |


Replace missing values with constant value across dataset:
```python
df = df.fillna(0)
```

Replace missing values in a specific column:
```python
df['Column1'] = df['Column1'].fillna(0)
```

Replace missing values with specific values per column, using a dictionary:
```python
new_values = {'Column1': 0, 'Column2': 5, 'Column3': 'Unknown'}
df = df.fillna(values=new_values)
```

### Exercise 9

Using the following DataFrame, solve the exercises below.

In [61]:
data = pd.DataFrame({'time': [0.5, 1., 1.5, None, 2.5, 3., 3.5, None], 'value': [
                    6, 4, 5, 8, None, 10, 11, None]})
data

   time  value
0   0.5    6.0
1   1.0    4.0
2   1.5    5.0
3   NaN    8.0
4   2.5    NaN
5   3.0   10.0
6   3.5   11.0
7   NaN    NaN

Replace all the missing "value" rows with zeros.

Replace the missing "time" rows with the previous value.

Replace all of the missing values with the data from the next row. What do you notice when you do this with this dataset?

Linearly interpolate the missing data. What is the result for this dataset?

---------------------------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------------------------------

# Advanced material

### Wide vs Long formats

Two formats for Pandas DataFrames: wide and long.

In the ```wide``` format, each feature (attribute) is a separate columns, while each row represents many features of the same individual entry. In the wide format, there are no repeated records, but there might be missing values. This format is preferable to perform statistics (e.g. mean).

In the ```long``` format, each row only shows one feature for each individual entry, and there are multiple rows for each entry (one for each feature). We often use this format for graphic plotting.

<table> <tr>
<td style="background:white"> <img src="../figures/wide_format.png" alt="Drawing" style="width: 450px;"/> </td>
<td style="background:white"> <img src="../figures/long_format.png" alt="Drawing" style="width: 450px;"/> </td>
</tr></table>

<div style="text-align: right"> From https://www.statology.org/long-vs-wide-data/ </div>

To go from a wide to a long dataframe we use `melt`:

In [3]:
wide_ls = [
    ['A', 88, 12, 22],
    ['B', 91, 17, 28],
    ['C', 99, 24, 30],
    ['D', 94, 28, 31]
]

wide = pd.DataFrame(wide_ls, columns=['Team', 'Points', 'Assists', 'Rebounds'])
wide

  Team  Points  Assists  Rebounds
0    A      88       12        22
1    B      91       17        28
2    C      99       24        30
3    D      94       28        31

In [4]:
long = pd.melt(wide, id_vars=['Team'])
long

   Team  variable  value
0     A    Points     88
1     B    Points     91
2     C    Points     99
3     D    Points     94
4     A   Assists     12
5     B   Assists     17
6     C   Assists     24
7     D   Assists     28
8     A  Rebounds     22
9     B  Rebounds     28
10    C  Rebounds     30
11    D  Rebounds     31

The opposite to `melt` is `pivot`:

In [25]:
wide_again = long.pivot(index='Team', columns='variable')['value']
wide_again

variable  Assists  Points  Rebounds
Team
A              12      88        22
B              17      91        28
C              24      99        30
D              28      94        31

We'll probably want to drop the multi index on the columns.

In [31]:
wide_again.columns = ['Assists', 'Points', 'Rebounds']
wide_again

      Assists  Points  Rebounds
Team
A          12      88        22
B          17      91        28
C          24      99        30
D          28      94        31

In [38]:
wide_again.reset_index(col_level=0, inplace= True)
wide_again

   index Team  Assists  Points  Rebounds
0      0    A       12      88        22
1      1    B       17      91        28
2      2    C       24      99        30
3      3    D       28      94        31

### Combining DataFrames

When performing operations on a dataset, we might sometimes need to combine different DataFrames and/or other Series. Pandas has a few functions that allows to do that: ```concat()```, ```join()```, and ```merge()```.

We'll show `merge` here:

In [50]:
#The first dataframe 

data1 = {'id': ['1', '2', '3', '4', '5'],
         'Age': [54, 36, 80, 71, 15]}
df1 = pd.DataFrame(data1)

df1

  id  Age
0  1   54
1  2   36
2  3   80
3  4   71
4  5   15

In [51]:
data2 = {'id': ['1', '2', '4', '7', '8'],
         'BloodPressure': [124, 120, 130, 125, 120],
         'BMI': [28, 20, 25, 30, 27]}
df2 = pd.DataFrame(data2)

df2

  id  BloodPressure  BMI
0  1            124   28
1  2            120   20
2  4            130   25
3  7            125   30
4  8            120   27

We specify the column we want to merge on:

In [52]:
merger_df = pd.merge(df1, df2, on='id')
merger_df

  id  Age  BloodPressure  BMI
0  1   54            124   28
1  2   36            120   20
2  4   71            130   25

By using the `how` argument we can control what kind of merge we get:

In [53]:
merger_df = pd.merge(df1, df2, on='id', how= 'outer')
merger_df

  id   Age  BloodPressure   BMI
0  1  54.0          124.0  28.0
1  2  36.0          120.0  20.0
2  3  80.0            NaN   NaN
3  4  71.0          130.0  25.0
4  5  15.0            NaN   NaN
5  7   NaN          125.0  30.0
6  8   NaN          120.0  27.0

In [54]:
merger_df = pd.merge(df1, df2, on='id', how = 'inner')
merger_df

  id  Age  BloodPressure  BMI
0  1   54            124   28
1  2   36            120   20
2  4   71            130   25

In [55]:
merger_df = pd.merge(df1, df2, on='id', how = 'left')
merger_df

  id  Age  BloodPressure   BMI
0  1   54          124.0  28.0
1  2   36          120.0  20.0
2  3   80            NaN   NaN
3  4   71          130.0  25.0
4  5   15            NaN   NaN

In [56]:
merger_df = pd.merge(df1, df2, on='id', how = 'right')
merger_df

  id   Age  BloodPressure  BMI
0  1  54.0            124   28
1  2  36.0            120   20
2  4  71.0            130   25
3  7   NaN            125   30
4  8   NaN            120   27

For more information and an easy to visualize guide for these methods, please check this link [this link](https://pandas.pydata.org/docs/user_guide/merging.html).

### Lambda and Mapping functions

You can, of course, write your own functions in Python, but ```lambda``` functions are often a faster and easier way to write simple functions on the fly.

To do so, you always start with the ```lambda``` keyword, followed by the names of the arguments, a colon and then the expression than specifies what we want the function to return. For example, if we want multiply two numbers:

```python
max_value = lambda x, y: x * y

a = 55
b = 34
max_value(a, b)
```

```lambda``` functions are especially useful when combined with mapping methods like ```map()``` and ```apply()```.

The **map** term indicates a function that takes one set of values and "maps" them to another set of values. In data science, we often need to create new representations or transform existing data. mapping functions help us do this work.

```map()``` is slightly simpler and takes in a function as argument, for example, a ```lambda``` function. Whatever function you pass though, make sure the expexted input is always a single value. The return of ```map()``` will be the original input value, transformed by the ```lambda``` function.

```python

average_cases = df.cases.mean()

df.cases.map(lambda x: x - average_cases)  # Centers the data distribution of number of cases around 0.
```

Besides functions, ```map()``` can also accept dictionaries (key corresponds to input value, and dictionary value is the new value to replace the input one), and Series.

```apply()``` is the equivalent method but when we want to transform an entire DataFrame. It can be applied row-wise or column-wise, depending whether the argument ```axis``` is set to ```rows``` or ```columns```, respectively.

```python
average_cases = df.cases.mean()

def center_mean(data):
    data.cases = data.cases - average_cases
    return data

df.apply(center_mean, axis='columns')
```

Differently from ```map()```, ```apply()``` also allows passing of positional or keyword arguments to the function.

```python
def get_deaths_class(value, lower_threshold, upper_threshold):
    if value >= int(upper_threshold):
        class_name = 'High'
    elif value <= int(lower_threshold):
        class_name = 'Low'
    else:
        class_name = 'Moderate'
        
    return class_name
        
df['deaths_class'] = df['deaths'].apply(get_deaths_class, lower_threshold = 20, upper_threshold = 100)
```

You can also use the ```apply()``` method in a group-wise analysis:

```python
df.groupby(['countriesAndTerritories', 'year', 'month']).apply(lambda df: df.loc[df.cases.idxmax()])
```


For more information of these methods and more, go to [Pandas API reference]('https://pandas.pydata.org/docs/reference/')

# Extra exercises

> Might include usage of other packages, including numpy.

## Simple vectorized operations

You want to plot the mathematical function

$f(x) = log(-1.3x^2 + 1.4^x + 7x + 50)$

For the numbers in $[0, 20]$. To do this, you need to create a vector `xs` with lots of numbers between 0 and 20, and a vector `ys` with $f$ evaluated at every element of `xs`. A vector is a `1d-ndarray`.

To get a hang of vectorized operations, solve the problem *without using any loops*:

### Create a `pandas.Series` `xs` with 1000 evenly spaced points between 0 and 20

### Create a Python function $f$ as seen above

### Evaluate `ys` = $f(x)$, i.e. $f$ of every element of `xs`.

### What is the mean and standard deviation of `ys`?

### How many elements of. `ys` are below 0? Between 1 and 2, both exclusive?

> Hint: You can use a comparison operator to get an array of dtype `bool`. To get the number of elements that are `True`, you can exploit the fact that `True` behaves similar to the number 1, and `False` similar to the number 0.

### What is the minimum and maximum value of `ys`?

### Create a series `non_negatives`, which contain all the values of `ys` that are nonnegative

### *Extra*: Use `matplotlib` to plot `xs` vs `ys` directly from your `Series` object

## Species depth matrix

Load in the data [`depths.csv`](https://drive.google.com/file/d/1d5694Ggnc-wq-ta0njlA9cz0_AEVQLoN/view). As you can see in drive preview, there are 11 columns, with columns 2-11 representing a sample from a human git microbiome. Each row represents a genome of a micro-organism, a so-called "operational taxonomic unit at 97% sequence identity" (OTU_97). The first row gives the name of the genome. The values in the matrix represents the relative abundance (or depth) of that micro-organism in that sample, i.e. how much of the micro-organism there is.

### Load in the matrix in a `pandas.DataFrame`

In [ ]:
url = 'https://raw.githubusercontent.com/Center-for-Health-Data-Science/PythonTsunami/fall2021/data/depths.csv'
depths = pd.read_csv(url)
depths

### How many OTUs are there? Show how you figured it out.

### Find the OTU "OTU_97.41189.0". What is the mean and standard deviations of the depths across the 10 samples of this OTU?

### How many samples have 0 depth of that OTU? (or rather, below detection limit?)

### What is the mean and standard deviation if you exclude those samples?

### Extra: How would you get all the means and std. deviations in one go?

### We are not interested in OTUs present in fewer than 4 samples. Remove all those OTUs.

### How many OTUs did you remove?

### How many OTUs have a depth of > 5 in all 10 samples? (hint: `np.all`)

### Filtering and Normalization

After discarding all OTUs present in fewer than 4 samples, sort the OTUs, do the following:

- Calculate the mean depth across samples for each remaining OTU.
   
- Normalize the remaining OTUs such that each row sum to 0 and have a standard deviation of 1 (so-called z-score normalization)
- Print the remaining OTUs to a new file in descending order by their mean depth, with a 12th column giving the mean depth, and columns 1-11 being the normalized depth. Make sure that your file looks like the input file (except with the 12th column)